pet-store/app/controllers/pets_controller.rb

    def index
        sort_by = params[:sort_by]
        @pets = Pet.order(sort_by)
---
SELECT "pets".* FROM "pets" ORDER BY name

    def detail
        @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def species
        @pets = Pet.where(species: params[:species].delete_suffix('s'))
---
SELECT "pets".* FROM "pets" WHERE "pets"."species" = ? LIMIT ?  [["species", "dogs"], ["LIMIT", 1]]